d = int(input('Введите день: '))
m = int(input('Введите месяц: '))
y = int(input('Введите год: '))

# список кол-ва дней в каждом месяце года
month_days = [31, 28, 31, 30, 31, 30, 31, 31, 30, 31, 30, 31]

# проверяем на высокосный год, то кол-во дней в месяце отличается
if (y % 4 == 0 and y % 100 != 0) or y % 400 == 0:
   month_days = [31, 29, 31, 30, 31, 30, 31, 31, 30, 31, 30, 31]

if d >= month_days[m - 1]:
   if m < 12:
      d1 = 1
      m1 = m + 1
      y1 = y
   else:
      d1 = 1
      m1 = 1
      y1 = y + 1
else:
   d1 = d+1
   m1 = m
   y1 = y

print(d1, m1, y1)


