import random

l=["Все будет хорошо",
   "Все окей",
   "ты отличный",
   "мама добра",
   "папа золотые руки,"
   "собака бежит по улице",
   "кошка пьет молоко",
   "школьник пишет диктант",
   "учитель объясняет материал",
   "сын читает книгу",
   "ребенок учит стих",
   "дети играют в лото",
   "Петя читает журнал",
   "Гриша играет в бадминтон",
   "Миша играет в теннис",
   "Лиза сломала ногу",
   "Петя обиделся на маму",
   "Все плохо",
   "эх как я не рад",
   "дети обиделись"]
r=random.randint(0,19)
print(l[r])